apple-open-source/macos/IOUSBFamily/AppleUSBHub/Classes/AppleUSBHub.cpp
            // Get the status for the port.  Note that the argument passed into this method is the port number.  If we get an
            // error from the call, then that means that our hub is not 100% so the device is probably not connected.  Otherwise
            // check the kHubPortConnection bit to see whether there is a device connected to the port or not
            //
            err = GetPortStatus(&status, * (UInt32 *) argument );
            if ( err != kIOReturnSuccess )
            {
                err = kIOReturnNoDevice;
            }
            else
            {
                USBLog(5,"%s[%p]::kIOUSBMessageHubIsDeviceConnected - port %d - status(%8x)/change(%8x)", getName(), this, * (UInt32 *) argument, status.statusFlags, status.changeFlags);
                if ( (status.statusFlags & kHubPortConnection) && !(status.changeFlags & kHubPortConnection) )
                    err = kIOReturnSuccess;
                else
                    err = kIOReturnNoDevice;
            }
            break;
            
        case kIOUSBMessageHubSuspendPort:
        case kIOUSBMessageHubResumePort:
        case kIOUSBMessageHubResetPort:
            err = DoPortAction( type, * (UInt32 *) argument, 0 );
            break;

        case kIOUSBMessageHubPortClearTT:
            ttParams = (IOUSBHubPortClearTTParam *) argument;
            err = DoPortAction( type, ttParams->portNumber, ttParams->options );
            break;
        
        case kIOUSBMessageHubReEnumeratePort:
            params = (IOUSBHubPortReEnumerateParam *) argument;
            err = DoPortAction( type, params->portNumber, params->options );
            break;
            
        case kIOMessageServiceIsTerminated: 	
            USBLog(3,"%s[%p] : Received kIOMessageServiceIsTerminated - ignoring", getName(), this);
            break;
            

        case kIOUSBMessagePortHasBeenReset:
             if ( isInactive() )
            {
                USBLog(5,"%s[%p] : got kIOUSBMessagePortHasBeenReset while isInactive() or _hubIsDead", getName(), this);
                err = kIOReturnSuccess;
                break;
            }
            
           // Should we do something here if we get an error?
            //
	    if (!_inStartMethod)
	    {
		_inStartMethod = true;
		IncrementOutstandingIO();		// make sure we don't close until start is done
		USBLog(3, "%s[%p]  Received kIOUSBMessagePortHasBeenReset -- reconfiguring hub", getName(), this);
		
                // Abort any transactions (should not have any pending at this point)
                //
                if ( _interruptPipe )
                {
                    _interruptPipe->Abort();
                    _interruptPipe = NULL;
                }
            
                // When we reconfigure the hub, we'll recreate the hubInterface, so let's tear it down.
                //
		if(_hubInterface) 
		{
		    _hubInterface->close(this);
		    _hubInterface->release();
		    _hubInterface = NULL;
		}
    
                // Reconfigure our Hub. 
		err = ConfigureHub();
		if ( err ) 
		{
		    USBLog(3, "%s[%p] Reconfiguring hub returned: 0x%x",getName(), this, err);
		}
                else
                {
                    USBError(1, "[%p] (Reset) USB Generic Hub @ %d (0x%x)", this, _address, _locationID);
                }
                
		_inStartMethod = false;
		DecrementOutstandingIO();

                // Only rearm the interrupt if we successfully configured the
                // hub
                if ( err == kIOReturnSuccess)
                {
                    err = RearmInterruptRead();
                }
	    }
    
            break;

        case kIOUSBMessagePortHasBeenResumed:
            err = kIOReturnSuccess;
            break;
            
        default:
            break;

    }
    
    return err;
}

IOReturn 
AppleUSBHub::DoDeviceRequest(IOUSBDevRequest *request)
{
    IOReturn err;
    
    // Paranoia:  if we don't have a device ('cause it was stop'ped), then don't send
    // the request.
    //
    if ( _device && !_device->isInactive() && _device->isOpen(this))
        err = _device->DeviceRequest(request, 5000, 0);
    else
        err = kIOReturnNoDevice;
        
    return err;
}

bool 
AppleUSBHub::finalize(IOOptionBits options)
{
    return(super::finalize(options));
}

void 
AppleUSBHub::TimeoutOccurred(OSObject *owner, IOTimerEventSource *sender)
{
    
    AppleUSBHub		*me;
    AppleUSBHubPort 	*port;
    UInt32		currentPort;

    me = OSDynamicCast(AppleUSBHub, owner);
    if (!me)
        return;

    if( me->_ports) 
        for (currentPort = 1; currentPort <= me->_hubDescriptor.numPorts; currentPort++)
        {
            port = me->_ports[currentPort-1];
            if (port) 
            {
                Boolean	locked;
                locked = port->GetDevZeroLock();
                if ( locked )
                {
                    // If the timeout flag for this port is already set, AND the timestamp is the same as when we
                    // first detected the lock, then is time to release the devZero lock
                    if ( ((me->_timeoutFlag & (1 << (currentPort-1))) != 0) && (me->_portTimeStamp[currentPort-1] == port->GetPortTimeStamp()) )
                    {
                        // Need to call through a separate thread because we will end up making synchronous calls
                        // to the USB bus.  That thread will clear the timeoutFlag for this port.
                        USBError(3,"%s[%p]::TimeoutOccurred error", me->getName(), me);
                        me->IncrementOutstandingIO();
                        thread_call_enter(me->_resetPortZeroThread);
                    }
                    else
                    {
                        // Set the timeout flag for this port
                        me->_timeoutFlag |= (1<<(currentPort-1));
                        
                        // Set the timestamp for the port
                        me->_portTimeStamp[currentPort-1] = port->GetPortTimeStamp();
                    }
                }
                else
                {
                    // Port is not locked, make sure that we clear the timeoutFlag for this port and reset the timestamp
                    me->_timeoutFlag &= ~( 1<<(currentPort-1));
                    me->_portTimeStamp[currentPort-1] = 0;
                }
            }
        }

